{
    "architectures": [
      "LlamaForCausalLM"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 128000,
    "eos_token_id": 128001,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 14336,
    "max_position_embeddings": 131072,
    "original_max_position_embeddings": 8192,
    "model_type": "llama",
    "num_attention_heads": 32,
    "num_hidden_layers": 32,
    "num_key_value_heads": 8,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_scaling": {
        "type": "longrope",
        "long_factor": [1, 1.097906416, 1.205398499, 1.323414747, 1.452985542, 1.595242149, 1.751426591, 1.922902493, 2.111166985, 2.317863779, 2.544797515, 2.79394952, 3.067495105, 3.367822558, 3.697553996, 4.059568257, 4.457026037, 4.893397485, 5.372492496, 5.898493984, 6.475994392, 7.110035795, 7.806153921, 8.570426477, 9.40952622, 10.33077921, 11.34222878, 12.45270576, 13.67190555, 15.01047283, 16.48009443, 18.09360142, 19.8650811, 21.81, 21.87, 21.88, 22.23, 22.28, 22.53, 22.65, 22.73, 22.89, 22.92, 23.18, 23.23, 23.36, 23.42, 23.47, 23.51, 23.52, 23.75, 23.82, 23.89, 24.06, 24.13, 24.14, 24.3, 24.53, 24.67, 24.75, 24.97, 25.49, 26.01, 26.05],
        "short_factor": [1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0, 1.0]
    },
    "rope_theta": 500000.0,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "use_cache": true,
    "vocab_size": 128256
}
